import React from 'react';

import Button from '@components/Button';

import styles from './Footer.module.scss';

export const Footer = () => {
  return (
    <footer className={styles.footer}>
      <div className={styles.footer_address}>
        <a href="tel:+7 700 511 17 77">+7 700 511 17 77</a>
        <p>
          Алматы, <br /> ул. оспанова, 85
        </p>
      </div>
      <p className={styles.footer_workTime}>
        Офис продаж: <br />
        Ежедневно 10:00-19:00
      </p>
      <div className={styles.footer_socials}>
        <Button transparent gold_border>
          Построить маршрут
        </Button>
        <Button transparent gold_border>
          <svg xmlns="http://www.w3.org/2000/svg" width="16" height="16" viewBox="0 0 16 16" fill="none">
            <path
              d="M14.4 8.00012C14.3986 8.57089 14.3922 9.14168 14.3844 9.71241C14.3749 10.401 14.3643 11.0899 14.1916 11.7667C14.0105 12.4764 13.6533 13.0885 13.0977 13.5417C12.5121 14.0192 11.8043 14.2702 11.0404 14.3166C10.0272 14.3783 9.01358 14.4026 7.99998 14.4002C6.98635 14.4026 5.97272 14.3783 4.95955 14.3166C4.19564 14.2702 3.48787 14.0192 2.90229 13.5417C2.34661 13.0885 1.98944 12.4764 1.80834 11.7667C1.63564 11.0899 1.62501 10.401 1.6156 9.71241C1.60779 9.14168 1.6013 8.57089 1.59998 8.00012C1.6013 7.42936 1.60779 6.85857 1.6156 6.28783C1.62501 5.59923 1.63564 4.91034 1.80834 4.23354C1.98944 3.52381 2.34661 2.91172 2.90229 2.45857C3.48787 1.98105 4.19564 1.73005 4.95955 1.6836C5.97272 1.62198 6.98635 1.59763 7.99998 1.60001C9.01358 1.59763 10.0272 1.62198 11.0404 1.6836C11.8043 1.73005 12.5121 1.98105 13.0977 2.45857C13.6533 2.91172 14.0105 3.52381 14.1916 4.23354C14.3643 4.91034 14.3749 5.59923 14.3844 6.28783C14.3922 6.85857 14.3986 7.42936 14.4 8.00012Z"
              stroke="#D6CBB4"
              strokeWidth="1.4"
              strokeLinecap="round"
              strokeLinejoin="round"
            />
            <path
              d="M10.8207 8.00057C10.8207 9.57324 9.5458 10.8481 7.97313 10.8481C6.40045 10.8481 5.12555 9.57324 5.12555 8.00057C5.12555 6.42789 6.40045 5.15299 7.97313 5.15299C9.5458 5.15299 10.8207 6.42789 10.8207 8.00057Z"
              stroke="#D6CBB4"
              strokeWidth="1.4"
              strokeLinecap="round"
              strokeLinejoin="round"
            />
            <path
              d="M12.3177 4.45857C12.3177 4.84199 12.0069 5.15283 11.6235 5.15283C11.24 5.15283 10.9292 4.84199 10.9292 4.45857C10.9292 4.07514 11.24 3.7643 11.6235 3.7643C12.0069 3.7643 12.3177 4.07514 12.3177 4.45857Z"
              fill="#D6CBB4"
            />
          </svg>
        </Button>
      </div>
      <div className={styles.footer_socials_extended}>
        <Button transparent gold_border>
          <svg xmlns="http://www.w3.org/2000/svg" width="16" height="16" viewBox="0 0 16 16" fill="none">
            <path
              d="M14.4 8.00012C14.3986 8.57089 14.3922 9.14168 14.3844 9.71241C14.3749 10.401 14.3643 11.0899 14.1916 11.7667C14.0105 12.4764 13.6533 13.0885 13.0977 13.5417C12.5121 14.0192 11.8043 14.2702 11.0404 14.3166C10.0272 14.3783 9.01358 14.4026 7.99998 14.4002C6.98635 14.4026 5.97272 14.3783 4.95955 14.3166C4.19564 14.2702 3.48787 14.0192 2.90229 13.5417C2.34661 13.0885 1.98944 12.4764 1.80834 11.7667C1.63564 11.0899 1.62501 10.401 1.6156 9.71241C1.60779 9.14168 1.6013 8.57089 1.59998 8.00012C1.6013 7.42936 1.60779 6.85857 1.6156 6.28783C1.62501 5.59923 1.63564 4.91034 1.80834 4.23354C1.98944 3.52381 2.34661 2.91172 2.90229 2.45857C3.48787 1.98105 4.19564 1.73005 4.95955 1.6836C5.97272 1.62198 6.98635 1.59763 7.99998 1.60001C9.01358 1.59763 10.0272 1.62198 11.0404 1.6836C11.8043 1.73005 12.5121 1.98105 13.0977 2.45857C13.6533 2.91172 14.0105 3.52381 14.1916 4.23354C14.3643 4.91034 14.3749 5.59923 14.3844 6.28783C14.3922 6.85857 14.3986 7.42936 14.4 8.00012Z"
              stroke="#D6CBB4"
              strokeWidth="1.4"
              strokeLinecap="round"
              strokeLinejoin="round"
            />
            <path
              d="M10.8207 8.00057C10.8207 9.57324 9.5458 10.8481 7.97313 10.8481C6.40045 10.8481 5.12555 9.57324 5.12555 8.00057C5.12555 6.42789 6.40045 5.15299 7.97313 5.15299C9.5458 5.15299 10.8207 6.42789 10.8207 8.00057Z"
              stroke="#D6CBB4"
              strokeWidth="1.4"
              strokeLinecap="round"
              strokeLinejoin="round"
            />
            <path
              d="M12.3177 4.45857C12.3177 4.84199 12.0069 5.15283 11.6235 5.15283C11.24 5.15283 10.9292 4.84199 10.9292 4.45857C10.9292 4.07514 11.24 3.7643 11.6235 3.7643C12.0069 3.7643 12.3177 4.07514 12.3177 4.45857Z"
              fill="#D6CBB4"
            />
          </svg>
          instagram
        </Button>
      </div>
      <div className={styles.footer_companyInfo}>
        <h3>hayat construction group</h3>
        <p>2023 © все права защищены!</p>
      </div>
      <p className={styles.footer_copyright}>
        Тұрғын үй құрылысына үлестік қатысу туралы заңына сәйкес үлестік қатысу туралы келісімшарт жергілікті атқарушы
        органның үлескерлердің ақшасын тартуға бер / Информация предоставлена с целью получения спроса потенциальных
        потребителей. Договоры о долевом участии заключаются после получения разрешения на привлечение денег дольщиков
        местным исполнительным органом согласно закона РК / Жобаның архитектурасы, абаттандырудың, қасбеттердің,
        интерьердің, қолданылатын материалдардың бейнелері, олардың нөмірленуі, кешеннің инфрақұрылымы шартты болып
        табылады және жобалау, салу және пайдалану барысында өзгертілуі мүмкін /Архитектура проекта, изображения
        благоустройства, фасадов, интерьера, применяемых материалов, их нумерация, инфраструктура комплекса являются
        условными и могут быть изменены в ходе проектирования, строительства и эксплуатации.
      </p>
    </footer>
  );
};
